# Nurmakhanova Aliya
# FP lab-3
# 1. Екі бүтін А және В саны берілген (А ≤ B бар). А-дан В-ға дейінгі барлық сандарды басып шығарыңыз.
# print("A-ны еңгізіңіз: ")  # санды енгізіңіз деген жазуды шығарады
# A = int(input())  # а-ны консольда еңгіземіз
# print("B-ны еңгізіңіз: ")
# B = int(input())  # b-ны консольда еңгіземіз
# for ab in range(A, B + 1):          # for циклы арқылы A дан B ға дейін шығару керектігі туралы диапазон қоямыз,
#     # B кірмегендіктен + 1 қосамыз
#     print(ab, end=' ')              # сосын print арқылы пробелмен шығарамыз


# 2. А және В екі бүтін сандар берілген. А<B болса, өсу ретімен немесе басқаша жағдайда кему ретімен
# А-дан В-ға дейінгі барлық сандарды басып шығарыңыз.
# print("A-ны еңгізіңіз: ")  # санды енгізіңіз деген жазуды шығарады
# A = int(input())           # а-ны консольда еңгіземіз
# print("B-ны еңгізіңіз: ")
# B = int(input())           # b-ны консольда еңгіземіз
# if A < B:                  # шарт қоямыз, А дан B үлкен болса, өсу ретімен
#     for ab in range(A, B + 1):
#         print(ab, end=' ')
# else:                             # болмаса, яғни A дан B кіші болса, кему ретімен
#     for ab in range(A, B - 1, -1):
#         print(ab, end=' ')

